In [1]:
import pandas as pd

In [7]:
df = pd.DataFrame({'Date': ['Jan 2015', 'Feb 2016', 'Mar 2017', 'Apr 2018', 'May 2019']})

In [8]:
df

       Date
0  Jan 2015
1  Feb 2016
2  Mar 2017
3  Apr 2018
4  May 2019

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    5 non-null      object
dtypes: object(1)
memory usage: 168.0+ bytes

In [15]:
df = df.astype('datetime64[ns]')
df

        Date
0 2015-01-01
1 2016-02-01
2 2017-03-01
3 2018-04-01
4 2019-05-01

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    5 non-null      datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 168.0 bytes

#### 2. Write a Pandas program to convert a Panda module Series to Python list and itâ€™s type.

In [16]:
a = pd.Series([1,2,3,4,5,6,7])
print(a)
print(type(a))
print(a.tolist())
print(type(a.tolist()))

0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int64
<class 'pandas.core.series.Series'>
[1, 2, 3, 4, 5, 6, 7]
<class 'list'>

#### 3. Pandas program to add, subtract, multiply and divide

In [17]:
a = pd.Series([2,4,5,6,7,8])
b = pd.Series([7,8,9,4,3,2])

ds = a+b
print(ds)
ds = a-b
print(ds)
ds = a*b
print(ds)
ds = a/b
print(ds)

0     9
1    12
2    14
3    10
4    10
5    10
dtype: int64
0   -5
1   -4
2   -4
3    2
4    4
5    6
dtype: int64
0    14
1    32
2    45
3    24
4    21
5    16
dtype: int64
0    0.285714
1    0.500000
2    0.555556
3    1.500000
4    2.333333
5    4.000000
dtype: float64

#### 4. Program to compare elements of two pandas series

In [18]:
a = pd.Series([2,4,5,6,7,8])
b = pd.Series([7,8,9,4,3,2])

print(a==b)
print(a>b)
print(a<b)

0    False
1    False
2    False
3    False
4    False
5    False
dtype: bool
0    False
1    False
2    False
3     True
4     True
5     True
dtype: bool
0     True
1     True
2     True
3    False
4    False
5    False
dtype: bool

#### 5.Converting dictionary to pandas series

In [22]:
x = {'a':150, 'b': 200, 'c': 300, 'd':400, 'e': 800}

df = pd.Series(x)
df

a    150
b    200
c    300
d    400
e    800
dtype: int64

#### 6.Prgram to convert numpy array to a pandas series

In [24]:
import numpy as np

x = np.array([1,2,3,4,5,6,7])
df = pd.Series(x)
df

0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int32

#### 7.Pandas program to change the datatype of given column or a series.

In [33]:
df = pd.Series([100,200,'python', 300.12,400])
print(df)
df = pd.to_numeric(df, errors='coerce')
print(df)

0       100
1       200
2    python
3    300.12
4       400
dtype: object
0    100.00
1    200.00
2       NaN
3    300.12
4    400.00
dtype: float64

#### 8.program to convert the first column of a Datafram as a Series

In [38]:
df = pd.DataFrame({'col1':[1,2,3,4,7,11], 'col2':[4,5,6,9,5,0], 'col3':[7,5,8,12,1,11]})
x = df['col1']
print(type(x))

<class 'pandas.core.series.Series'>

#### 9. write a pandas program to convert a given series to an array.

In [47]:
df = pd.Series([100,200,'python', 300.12,400])
print(df)
x = np.array(df.values.tolist())
print(x)

0       100
1       200
2    python
3    300.12
4       400
dtype: object
['100' '200' 'python' '300.12' '400']

#### 10.program to convert series of lists to one series.

In [45]:
a = pd.Series([['Red', 'Green', 'White'],
    ['Red', 'Black'],
    ['Yellow']])
print(a)
a = a.apply(pd.Series).stack().reset_index(drop=True)
print(a)

0    [Red, Green, White]
1           [Red, Black]
2               [Yellow]
dtype: object
0       Red
1     Green
2     White
3       Red
4     Black
5    Yellow
dtype: object

#### 11.Pandas program to sort a given series

In [53]:
df = pd.Series(['100','200','python', '300.12','400'])
print(df)
df1 = pd.Series(df).sort_values()
print(df1)

0       100
1       200
2    python
3    300.12
4       400
dtype: object
0       100
1       200
3    300.12
4       400
2    python
dtype: object

#### 12.Write a Pandas program to get the items which are not common of two given series.

In [57]:
a = pd.Series([1,2,3,4,5])
b = pd.Series([2,4,6,8,10])

sr11 = pd.Series(np.union1d(a, b))
print(sr11)
sr22 = pd.Series(np.intersect1d(a, b))
print(sr22)
result = sr11[~sr11.isin(sr22)]
print(result)

0     1
1     2
2     3
3     4
4     5
5     6
6     8
7    10
dtype: int64
0    2
1    4
dtype: int64
0     1
2     3
4     5
5     6
6     8
7    10
dtype: int64

#### 13. program to compute minimum, 25th percentile, median, 75th percentile and maximum

In [60]:
x = np.random.RandomState(100)
y = pd.Series(x.normal(10, 4, 20))
print(y)
result = np.percentile(y, q=[0, 25, 50, 75, 100])
print(result)

0      3.000938
1     11.370722
2     14.612143
3      8.990256
4     13.925283
5     12.056875
6     10.884719
7      5.719827
8      9.242017
9     11.020006
10     8.167892
11    11.740654
12     7.665620
13    13.267388
14    12.690883
15     9.582355
16     7.874878
17    14.118931
18     8.247458
19     5.526727
dtype: float64
[ 3.00093811  8.09463867 10.23353705 12.21537733 14.61214321]

#### 14. Write a Pandas program to calculate the frequency counts of each unique value of a given series.

In [63]:
num_series = pd.Series(np.take(list('0123456789'), np.random.randint(10, size=40)))
print("Original Series:")
print(num_series)
print("Frequency of each unique value of the said series.")
result = num_series.value_counts()
print(result)

Original Series:
0     4
1     8
2     2
3     3
4     0
5     4
6     2
7     2
8     9
9     7
10    8
11    9
12    7
13    4
14    3
15    5
16    7
17    5
18    0
19    5
20    6
21    8
22    7
23    1
24    6
25    2
26    8
27    6
28    7
29    1
30    4
31    4
32    9
33    8
34    0
35    1
36    2
37    1
38    8
39    2
dtype: object
Frequency of each unique value of the said series.
8    6
2    6
4    5
7    5
1    4
0    3
9    3
5    3
6    3
3    2
dtype: int64

#### 15.Write a pandas program to convert given series into a dataframe with its index a another column on the dataframe.

In [64]:
char_list = list('ABCDEFGHIJKLMNOP')
num_arra = np.arange(8)
num_dict = dict(zip(char_list, num_arra))
num_ser = pd.Series(num_dict)
df = num_ser.to_frame().reset_index()
print(df.head())

  index  0
0     A  0
1     B  1
2     C  2
3     D  3
4     E  4

#### 16. Write a pandas program to stack two given series vertically and horizontally.

In [67]:
series1 = pd.Series(range(10))
series2 = pd.Series(list('pqrstuvwxy'))

print(series1)
print(series2)
print(series1.append(series2))
df = pd.concat([series1, series2], axis=1)
print(df)

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64
0    p
1    q
2    r
3    s
4    t
5    u
6    v
7    w
8    x
9    y
dtype: object
0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
0    p
1    q
2    r
3    s
4    t
5    u
6    v
7    w
8    x
9    y
dtype: object
   0  1
0  0  p
1  1  q
2  2  r
3  3  s
4  4  t
5  5  u
6  6  v
7  7  w
8  8  x
9  9  y

#### 17. Write a pandas program to check the equality of two given series.

In [68]:
a = pd.Series([1, 8, 7, 5, 6, 5, 3, 4, 7, 1])
b = pd.Series([1, 8, 7, 5, 6, 5, 3, 4, 7, 1])

print(a==b)

0    True
1    True
2    True
3    True
4    True
5    True
6    True
7    True
8    True
9    True
dtype: bool

#### 18.Write a Pandas program to find the index of the first occurrence of the smallest and largest value of a given series.

In [70]:
a = pd.Series([1, 3, 7, 12, 88, 23, 3, 1, 9, 0])
print(a.idxmin())
print(a.idxmax())

9
4

#### 19.Write a pandas program to check inequality over the index axis of a given dataframe and a given series.

In [72]:
a = pd.DataFrame({'W':[68,75,86,80,None],'X':[78,75,None,80,86], 'Y':[84,94,89,86,86],'Z':[86,97,96,72,83]});
b = pd.Series([68, 75, 86, 80, None]) 
print(a)
print(b)
print(a.ne(b, axis = 0))

      W     X   Y   Z
0  68.0  78.0  84  86
1  75.0  75.0  94  97
2  86.0   NaN  89  96
3  80.0  80.0  86  72
4   NaN  86.0  86  83
0    68.0
1    75.0
2    86.0
3    80.0
4     NaN
dtype: float64
       W      X     Y     Z
0  False   True  True  True
1  False  False  True  True
2  False   True  True  True
3  False  False  True  True
4   True   True  True  True

#### 20.Write a pandas program to get lowest n records within each group of a given DataFrame

In [73]:
a = {'col1': [1, 2, 3, 4, 7, 11], 'col2': [4, 5, 6, 9, 5, 0], 'col3': [7, 5, 8, 12, 1,11]}
b = pd.DataFrame(data=a)

print(b)

df1 = b.nsmallest(3, 'col1')
print(df1)
df2 = b.nsmallest(3, 'col2')
print(df2)
df3 = b.nsmallest(3, 'col3')
print(df3)

   col1  col2  col3
0     1     4     7
1     2     5     5
2     3     6     8
3     4     9    12
4     7     5     1
5    11     0    11
   col1  col2  col3
0     1     4     7
1     2     5     5
2     3     6     8
   col1  col2  col3
5    11     0    11
0     1     4     7
1     2     5     5
   col1  col2  col3
4     7     5     1
1     2     5     5
0     1     4     7

#### 21.Write a pandas program to remove first n rows of a given DataFrame.

In [74]:
a = {'col1': [1, 2, 3, 4, 7, 11], 'col2': [4, 5, 6, 9, 5, 0], 'col3': [7, 5, 8, 12, 1,11]}
df = pd.DataFrame(data=a)

print(df)

df1 = df.iloc[3:]
print(df1)

   col1  col2  col3
0     1     4     7
1     2     5     5
2     3     6     8
3     4     9    12
4     7     5     1
5    11     0    11
   col1  col2  col3
3     4     9    12
4     7     5     1
5    11     0    11

#### 22.Write a pandas program to display the default index and set a column as an index in a given dataframe.

In [76]:
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4'],
    't_id':['t1', 't2', 't3', 't4', 't5', 't6']})

print(df.head(10))

df1 = df.set_index('t_id')
print(df1)

df2 = df1.reset_index(inplace=False)
print(df2)

  school_code class            name date_Of_Birth  weight  address t_id
0        s001     V  Alberto Franco    15/05/2002      35  street1   t1
1        s002     V    Gino Mcneill    17/05/2002      32  street2   t2
2        s003    VI     Ryan Parkes    16/02/1999      33  street3   t3
3        s001    VI    Eesha Hinton    25/09/1998      30  street1   t4
4        s002     V    Gino Mcneill    11/05/2002      31  street2   t5
5        s004    VI    David Parkes    15/09/1997      32  street4   t6
     school_code class            name date_Of_Birth  weight  address
t_id
t1          s001     V  Alberto Franco    15/05/2002      35  street1
t2          s002     V    Gino Mcneill    17/05/2002      32  street2
t3          s003    VI     Ryan Parkes    16/02/1999      33  street3
t4          s001    VI    Eesha Hinton    25/09/1998      30  street1
t5          s002     V    Gino Mcneill    11/05/2002      31  street2
t6          s004    VI    David Parkes    15/09/1997      32  street4
  t_id school_code class            name date_Of_Birth  weight  address
0   t1        s001     V  Alberto Franco    15/05/2002      35  street1
1   t2        s002     V    Gino Mcneill    17/05/2002      32  street2
2   t3        s003    VI     Ryan Parkes    16/02/1999      33  street3
3   t4        s001    VI    Eesha Hinton    25/09/1998      30  street1
4   t5        s002     V    Gino Mcneill    11/05/2002      31  street2
5   t6        s004    VI    David Parkes    15/09/1997      32  street4

#### 23.Write a pandas program to create a multi index frame using two columns and using an index and a column.

In [77]:
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4'],
    't_id':['t1', 't2', 't3', 't4', 't5', 't6']})

print(df)

df1 = df.set_index(['t_id', 'school_code'])
print(df1)

df2 = df.set_index([pd.Index([0, 1, 2, 3, 4, 5]), 't_id'])
print(df2)

  school_code class            name date_Of_Birth  weight  address t_id
0        s001     V  Alberto Franco    15/05/2002      35  street1   t1
1        s002     V    Gino Mcneill    17/05/2002      32  street2   t2
2        s003    VI     Ryan Parkes    16/02/1999      33  street3   t3
3        s001    VI    Eesha Hinton    25/09/1998      30  street1   t4
4        s002     V    Gino Mcneill    11/05/2002      31  street2   t5
5        s004    VI    David Parkes    15/09/1997      32  street4   t6
                 class            name date_Of_Birth  weight  address
t_id school_code
t1   s001            V  Alberto Franco    15/05/2002      35  street1
t2   s002            V    Gino Mcneill    17/05/2002      32  street2
t3   s003           VI     Ryan Parkes    16/02/1999      33  street3
t4   s001           VI    Eesha Hinton    25/09/1998      30  street1
t5   s002            V    Gino Mcneill    11/05/2002      31  street2
t6   s004           VI    David Parkes    15/09/1997      32  street4
       school_code class            name date_Of_Birth  weight  address
  t_id
0 t1          s001     V  Alberto Franco    15/05/2002      35  street1
1 t2          s002     V    Gino Mcneill    17/05/2002      32  street2
2 t3          s003    VI     Ryan Parkes    16/02/1999      33  street3
3 t4          s001    VI    Eesha Hinton    25/09/1998      30  street1
4 t5          s002     V    Gino Mcneill    11/05/2002      31  street2
5 t6          s004    VI    David Parkes    15/09/1997      32  street4

#### 24.Write a pandas program to display the default index and set a column as an index in a given dataframe and then reset the index.

In [78]:
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4'],
    't_id':['t1', 't2', 't3', 't4', 't5', 't6']})

print(df.head(10))

df1 = df.set_index('t_id')
print(df1)

df2 = df1.reset_index(inplace=False)
print(df2)

  school_code class            name date_Of_Birth  weight  address t_id
0        s001     V  Alberto Franco    15/05/2002      35  street1   t1
1        s002     V    Gino Mcneill    17/05/2002      32  street2   t2
2        s003    VI     Ryan Parkes    16/02/1999      33  street3   t3
3        s001    VI    Eesha Hinton    25/09/1998      30  street1   t4
4        s002     V    Gino Mcneill    11/05/2002      31  street2   t5
5        s004    VI    David Parkes    15/09/1997      32  street4   t6
     school_code class            name date_Of_Birth  weight  address
t_id
t1          s001     V  Alberto Franco    15/05/2002      35  street1
t2          s002     V    Gino Mcneill    17/05/2002      32  street2
t3          s003    VI     Ryan Parkes    16/02/1999      33  street3
t4          s001    VI    Eesha Hinton    25/09/1998      30  street1
t5          s002     V    Gino Mcneill    11/05/2002      31  street2
t6          s004    VI    David Parkes    15/09/1997      32  street4
  t_id school_code class            name date_Of_Birth  weight  address
0   t1        s001     V  Alberto Franco    15/05/2002      35  street1
1   t2        s002     V    Gino Mcneill    17/05/2002      32  street2
2   t3        s003    VI     Ryan Parkes    16/02/1999      33  street3
3   t4        s001    VI    Eesha Hinton    25/09/1998      30  street1
4   t5        s002     V    Gino Mcneill    11/05/2002      31  street2
5   t6        s004    VI    David Parkes    15/09/1997      32  street4

#### 31. Write a pandas program to create an index labels by using 64-bit integers, using floating-point numbers in a given dataframe.

In [79]:
import pandas as pd
print("Create an Int64Index:")
df_i64 = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4']},
    index=[1, 2, 3, 4, 5, 6])
print(df_i64)
print("\nView the Index:")
print(df_i64.index)

print("\nFloating-point labels using Float64Index:")
df_f64 = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth ': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4']},
    index=[.1, .2, .3, .4, .5, .6])
print(df_f64)
print("\nView the Index:")
print(df_f64.index)

Create an Int64Index:
  school_code class            name date_Of_Birth  weight  address
1        s001     V  Alberto Franco    15/05/2002      35  street1
2        s002     V    Gino Mcneill    17/05/2002      32  street2
3        s003    VI     Ryan Parkes    16/02/1999      33  street3
4        s001    VI    Eesha Hinton    25/09/1998      30  street1
5        s002     V    Gino Mcneill    11/05/2002      31  street2
6        s004    VI    David Parkes    15/09/1997      32  street4

View the Index:
Int64Index([1, 2, 3, 4, 5, 6], dtype='int64')

Floating-point labels using Float64Index:
    school_code class            name date_Of_Birth   weight  address
0.1        s001     V  Alberto Franco     15/05/2002      35  street1
0.2        s002     V    Gino Mcneill     17/05/2002      32  street2
0.3        s003    VI     Ryan Parkes     16/02/1999      33  street3
0.4        s001    VI    Eesha Hinton     25/09/1998      30  street1
0.5        s002     V    Gino Mcneill     11/05/2002      31  street2
0.6        s004    VI    David Parkes     15/09/1997      32  street4

View the Index:
Float64Index([0.1, 0.2, 0.3, 0.4, 0.5, 0.6], dtype='float64')

#### 32. Write a pandas program to create a dataframe indexing by date and time.

In [80]:
dte = pd.date_range(start = '2020-05-12 07:10:10', freq = 'S', periods = 10)
df = pd.DataFrame({'Sale Amount':[100,110,117,150,112, 99, 129, 135, 140, 150]}, index = dte)

df

                     Sale Amount
2020-05-12 07:10:10          100
2020-05-12 07:10:11          110
2020-05-12 07:10:12          117
2020-05-12 07:10:13          150
2020-05-12 07:10:14          112
2020-05-12 07:10:15           99
2020-05-12 07:10:16          129
2020-05-12 07:10:17          135
2020-05-12 07:10:18          140
2020-05-12 07:10:19          150

#### 33. Write a pandas program to join the two given dataframe along rows and assign all data.

In [83]:
df1 = pd.DataFrame({
        'student_id': ['S1', 'S2', 'S3', 'S4', 'S5'],
         'name': ['Danniella Fenton', 'Ryder Storey', 'Bryce Jensen', 'Ed Bernal', 'Kwame Morin'], 
        'marks': [200, 210, 190, 222, 199]})

df2 = pd.DataFrame({
        'student_id': ['S4', 'S5', 'S6', 'S7', 'S8'],
        'name': ['Scarlette Fisher', 'Carla Williamson', 'Dante Morse', 'Kaiser William', 'Madeeha Preston'], 
        'marks': [201, 200, 198, 219, 201]})

df3 = pd.concat([df1,df2])
df3

  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199
0         S4  Scarlette Fisher    201
1         S5  Carla Williamson    200
2         S6       Dante Morse    198
3         S7    Kaiser William    219
4         S8   Madeeha Preston    201

#### 34. Write a pandas program to join the two given dataframes along columns and assign all data.

In [85]:
df1 = pd.DataFrame({
        'student_id': ['S1', 'S2', 'S3', 'S4', 'S5'],
         'name': ['Danniella Fenton', 'Ryder Storey', 'Bryce Jensen', 'Ed Bernal', 'Kwame Morin'], 
        'marks': [200, 210, 190, 222, 199]})

df2 = pd.DataFrame({
        'student_id': ['S4', 'S5', 'S6', 'S7', 'S8'],
        'name': ['Scarlette Fisher', 'Carla Williamson', 'Dante Morse', 'Kaiser William', 'Madeeha Preston'], 
        'marks': [201, 200, 198, 219, 201]})

df3 = pd.concat([df1,df2], axis = 1)
df3

  student_id              name  marks student_id              name  marks
0         S1  Danniella Fenton    200         S4  Scarlette Fisher    201
1         S2      Ryder Storey    210         S5  Carla Williamson    200
2         S3      Bryce Jensen    190         S6       Dante Morse    198
3         S4         Ed Bernal    222         S7    Kaiser William    219
4         S5       Kwame Morin    199         S8   Madeeha Preston    201

#### 35.Write a pandas program to join the two given dataframes along rows and merge with another dataframe along the common column id.

In [86]:
df1 = pd.DataFrame({
        'student_id': ['S1', 'S2', 'S3', 'S4', 'S5'],
         'name': ['Danniella Fenton', 'Ryder Storey', 'Bryce Jensen', 'Ed Bernal', 'Kwame Morin'], 
        'marks': [200, 210, 190, 222, 199]})

df2 = pd.DataFrame({
        'student_id': ['S4', 'S5', 'S6', 'S7', 'S8'],
        'name': ['Scarlette Fisher', 'Carla Williamson', 'Dante Morse', 'Kaiser William', 'Madeeha Preston'], 
        'marks': [201, 200, 198, 219, 201]})

df3 = pd.DataFrame({
        'student_id': ['S1', 'S2', 'S3', 'S4', 'S5', 'S7', 'S8', 'S9', 'S10', 'S11', 'S12', 'S13'],
        'exam_id': [23, 45, 12, 67, 21, 55, 33, 14, 56, 83, 88, 12]})

pre = pd.concat([df1,df2])
final = pd.merge(pre, df3,on = 'student_id')
final

  student_id              name  marks  exam_id
0         S1  Danniella Fenton    200       23
1         S2      Ryder Storey    210       45
2         S3      Bryce Jensen    190       12
3         S4         Ed Bernal    222       67
4         S4  Scarlette Fisher    201       67
5         S5       Kwame Morin    199       21
6         S5  Carla Williamson    200       21
7         S7    Kaiser William    219       55
8         S8   Madeeha Preston    201       33